In [19]:
import pandas as ps
data = ps.read_csv(r'D:\Data Science\employee salary dataset.csv', index_col='EmployeeID')

In [20]:
data

,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
EmployeeID,,,,,,,,
1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
5,Employee_5,Operations,15,Master,36,Female,Delhi,132450
6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818
7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525
8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830
9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429
10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893
11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381
12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909
13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333
14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436
15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290
16,Employee_16,Finance,4,High School,49,Female,Delhi,101213
17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895
18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738
19,Employee_19,HR,2,PhD,32,Male,Chennai,55746
20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377
21,Employee_21,Finance,4,Master,46,Female,Delhi,73404
22,Employee_22,Operations,14,Master,54,Female,Delhi,79045
23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888
24,Employee_24,HR,15,Master,48,Male,Bangalore,64790
25,Employee_25,HR,8,High School,34,Female,Bangalore,132455
26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600
27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660
28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179
29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764
30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543
31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714
32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835
33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946
34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616
35,Employee_35,IT,13,Master,53,Male,Bangalore,130983
36,Employee_36,Operations,1,Master,45,Female,Delhi,98744
37,Employee_37,IT,7,High School,33,Male,Chennai,81491
38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123
39,Employee_39,HR,1,Master,24,Male,Mumbai,43589
40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484
41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989
42,Employee_42,HR,11,PhD,23,Male,Chennai,61212
43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525
44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202
45,Employee_45,Finance,8,Master,53,Male,Delhi,57635
46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208
47,Employee_47,Finance,3,Master,22,Female,Delhi,58828
48,Employee_48,Operations,1,High School,40,Male,Chennai,43711
49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420
50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752

In [21]:
data.head()

,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary
EmployeeID,,,,,,,,
1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416
2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271
3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064
4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091
5,Employee_5,Operations,15,Master,36,Female,Delhi,132450

In [5]:
data.describe()

       EmployeeID  Experience_Years        Age  Monthly_Salary
count    50.00000         50.000000  50.000000         50.0000
mean     25.50000          9.900000  39.760000      82288.8000
std      14.57738          5.349995  11.539745      33521.4379
min       1.00000          1.000000  22.000000      28420.0000
25%      13.25000          5.250000  28.250000      59424.0000
50%      25.50000         10.000000  43.500000      73890.5000
75%      37.75000         14.750000  49.000000     107219.0000
max      50.00000         19.000000  57.000000     149123.0000

In [6]:
data['Expense']=data['Monthly_Salary']*0.5

In [7]:
data

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,Expense
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416,55708.0
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271,47635.5
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064,34532.0
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091,47545.5
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450,66225.0
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818,32909.0
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525,35262.5
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830,22415.0
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429,21214.5
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893,15946.5
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381,70690.5
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909,52454.5
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333,36166.5
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436,14218.0
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290,49645.0
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213,50606.5
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895,15447.5
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738,22369.0
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746,27873.0
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377,37188.5
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404,36702.0
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045,39522.5
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888,61444.0
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790,32395.0
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455,66227.5
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600,15300.0
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660,59830.0
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179,59089.5
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764,32882.0
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543,49771.5
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714,35357.0
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835,40917.5
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946,63973.0
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616,67308.0
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983,65491.5
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744,49372.0
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491,40745.5
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123,74561.5
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589,21794.5
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484,34242.0
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989,53994.5
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212,30606.0
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525,34262.5
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202,36101.0
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635,28817.5
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208,44104.0
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828,29414.0
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711,21855.5
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420,14210.0
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752,60876.0

In [10]:
data['Entry_Age'] = data['Age'] - data['Experience_Years']

In [11]:
data

,EmployeeID,Name,Department,Experience_Years,Education_Level,Age,Gender,City,Monthly_Salary,Expense,Entry_Age
0,1,Employee_1,Marketing,15,Master,53,Female,Delhi,111416,55708.0,38
1,2,Employee_2,Operations,7,Bachelor,25,Female,Bangalore,95271,47635.5,18
2,3,Employee_3,IT,12,High School,51,Female,Hyderabad,69064,34532.0,39
3,4,Employee_4,Operations,8,PhD,44,Male,Delhi,95091,47545.5,36
4,5,Employee_5,Operations,15,Master,36,Female,Delhi,132450,66225.0,21
5,6,Employee_6,Finance,3,High School,50,Male,Mumbai,65818,32909.0,47
6,7,Employee_7,IT,14,PhD,57,Male,Mumbai,70525,35262.5,43
7,8,Employee_8,IT,17,PhD,34,Female,Bangalore,44830,22415.0,17
8,9,Employee_9,IT,4,Bachelor,53,Male,Hyderabad,42429,21214.5,49
9,10,Employee_10,Operations,18,High School,28,Male,Mumbai,31893,15946.5,10
10,11,Employee_11,Marketing,8,PhD,43,Male,Delhi,141381,70690.5,35
11,12,Employee_12,IT,4,Master,49,Female,Hyderabad,104909,52454.5,45
12,13,Employee_13,Operations,2,Master,23,Female,Hyderabad,72333,36166.5,21
13,14,Employee_14,Finance,6,Bachelor,27,Male,Delhi,28436,14218.0,21
14,15,Employee_15,Marketing,10,PhD,49,Female,Mumbai,99290,49645.0,39
15,16,Employee_16,Finance,4,High School,49,Female,Delhi,101213,50606.5,45
16,17,Employee_17,Marketing,18,Master,41,Female,Hyderabad,30895,15447.5,23
17,18,Employee_18,Operations,12,PhD,51,Female,Chennai,44738,22369.0,39
18,19,Employee_19,HR,2,PhD,32,Male,Chennai,55746,27873.0,30
19,20,Employee_20,Marketing,10,Bachelor,49,Male,Bangalore,74377,37188.5,39
20,21,Employee_21,Finance,4,Master,46,Female,Delhi,73404,36702.0,42
21,22,Employee_22,Operations,14,Master,54,Female,Delhi,79045,39522.5,40
22,23,Employee_23,Marketing,16,High School,22,Male,Bangalore,122888,61444.0,6
23,24,Employee_24,HR,15,Master,48,Male,Bangalore,64790,32395.0,33
24,25,Employee_25,HR,8,High School,34,Female,Bangalore,132455,66227.5,26
25,26,Employee_26,IT,14,Master,24,Male,Hyderabad,30600,15300.0,10
26,27,Employee_27,IT,8,Bachelor,27,Female,Delhi,119660,59830.0,19
27,28,Employee_28,Finance,16,Master,29,Female,Hyderabad,118179,59089.5,13
28,29,Employee_29,Marketing,13,High School,48,Male,Bangalore,65764,32882.0,35
29,30,Employee_30,Marketing,18,High School,30,Male,Delhi,99543,49771.5,12
30,31,Employee_31,IT,15,Bachelor,54,Female,Hyderabad,70714,35357.0,39
31,32,Employee_32,Marketing,13,Master,45,Female,Hyderabad,81835,40917.5,32
32,33,Employee_33,Marketing,9,Master,36,Male,Bangalore,127946,63973.0,27
33,34,Employee_34,HR,15,Bachelor,53,Female,Delhi,134616,67308.0,38
34,35,Employee_35,IT,13,Master,53,Male,Bangalore,130983,65491.5,40
35,36,Employee_36,Operations,1,Master,45,Female,Delhi,98744,49372.0,44
36,37,Employee_37,IT,7,High School,33,Male,Chennai,81491,40745.5,26
37,38,Employee_38,Operations,9,Master,23,Male,Mumbai,149123,74561.5,14
38,39,Employee_39,HR,1,Master,24,Male,Mumbai,43589,21794.5,23
39,40,Employee_40,Finance,12,Bachelor,38,Female,Mumbai,68484,34242.0,26
40,41,Employee_41,Marketing,8,Bachelor,23,Female,Bangalore,107989,53994.5,15
41,42,Employee_42,HR,11,PhD,23,Male,Chennai,61212,30606.0,12
42,43,Employee_43,Marketing,19,High School,49,Female,Delhi,68525,34262.5,30
43,44,Employee_44,Finance,17,Master,44,Male,Hyderabad,72202,36101.0,27
44,45,Employee_45,Finance,8,Master,53,Male,Delhi,57635,28817.5,45
45,46,Employee_46,HR,3,PhD,54,Female,Hyderabad,88208,44104.0,51
46,47,Employee_47,Finance,3,Master,22,Female,Delhi,58828,29414.0,19
47,48,Employee_48,Operations,1,High School,40,Male,Chennai,43711,21855.5,39
48,49,Employee_49,Finance,5,PhD,23,Female,Hyderabad,28420,14210.0,18
49,50,Employee_50,Marketing,10,High School,47,Female,Bangalore,121752,60876.0,37

In [12]:
data['Name']

0      Employee_1
1      Employee_2
2      Employee_3
3      Employee_4
4      Employee_5
5      Employee_6
6      Employee_7
7      Employee_8
8      Employee_9
9     Employee_10
10    Employee_11
11    Employee_12
12    Employee_13
13    Employee_14
14    Employee_15
15    Employee_16
16    Employee_17
17    Employee_18
18    Employee_19
19    Employee_20
20    Employee_21
21    Employee_22
22    Employee_23
23    Employee_24
24    Employee_25
25    Employee_26
26    Employee_27
27    Employee_28
28    Employee_29
29    Employee_30
30    Employee_31
31    Employee_32
32    Employee_33
33    Employee_34
34    Employee_35
35    Employee_36
36    Employee_37
37    Employee_38
38    Employee_39
39    Employee_40
40    Employee_41
41    Employee_42
42    Employee_43
43    Employee_44
44    Employee_45
45    Employee_46
46    Employee_47
47    Employee_48
48    Employee_49
49    Employee_50
Name: Name, dtype: object

In [17]:
columns=['Name','Age']
data[columns]

           Name  Age
0    Employee_1   53
1    Employee_2   25
2    Employee_3   51
3    Employee_4   44
4    Employee_5   36
5    Employee_6   50
6    Employee_7   57
7    Employee_8   34
8    Employee_9   53
9   Employee_10   28
10  Employee_11   43
11  Employee_12   49
12  Employee_13   23
13  Employee_14   27
14  Employee_15   49
15  Employee_16   49
16  Employee_17   41
17  Employee_18   51
18  Employee_19   32
19  Employee_20   49
20  Employee_21   46
21  Employee_22   54
22  Employee_23   22
23  Employee_24   48
24  Employee_25   34
25  Employee_26   24
26  Employee_27   27
27  Employee_28   29
28  Employee_29   48
29  Employee_30   30
30  Employee_31   54
31  Employee_32   45
32  Employee_33   36
33  Employee_34   53
34  Employee_35   53
35  Employee_36   45
36  Employee_37   33
37  Employee_38   23
38  Employee_39   24
39  Employee_40   38
40  Employee_41   23
41  Employee_42   23
42  Employee_43   49
43  Employee_44   44
44  Employee_45   53
45  Employee_46   54
46  Employee_47   22
47  Employee_48   40
48  Employee_49   23
49  Employee_50   47

In [18]:
col = ['Name','Department']
data[col]

           Name  Department
0    Employee_1   Marketing
1    Employee_2  Operations
2    Employee_3          IT
3    Employee_4  Operations
4    Employee_5  Operations
5    Employee_6     Finance
6    Employee_7          IT
7    Employee_8          IT
8    Employee_9          IT
9   Employee_10  Operations
10  Employee_11   Marketing
11  Employee_12          IT
12  Employee_13  Operations
13  Employee_14     Finance
14  Employee_15   Marketing
15  Employee_16     Finance
16  Employee_17   Marketing
17  Employee_18  Operations
18  Employee_19          HR
19  Employee_20   Marketing
20  Employee_21     Finance
21  Employee_22  Operations
22  Employee_23   Marketing
23  Employee_24          HR
24  Employee_25          HR
25  Employee_26          IT
26  Employee_27          IT
27  Employee_28     Finance
28  Employee_29   Marketing
29  Employee_30   Marketing
30  Employee_31          IT
31  Employee_32   Marketing
32  Employee_33   Marketing
33  Employee_34          HR
34  Employee_35          IT
35  Employee_36  Operations
36  Employee_37          IT
37  Employee_38  Operations
38  Employee_39          HR
39  Employee_40     Finance
40  Employee_41   Marketing
41  Employee_42          HR
42  Employee_43   Marketing
43  Employee_44     Finance
44  Employee_45     Finance
45  Employee_46          HR
46  Employee_47     Finance
47  Employee_48  Operations
48  Employee_49     Finance
49  Employee_50   Marketing